In [2]:
# importacion de la libreria NUMPY
import numpy
# creacion de un ARREGLO
arreglo = numpy.array([[1,2,3], [4,5,6], [7,8,9]])
arreglo

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [6]:
##De esta forma le damos un ALIAS a NUMPY
import numpy as np
arreglo = np.array([[1,2,3], [4,5,6], [7,8,9]])
arreglo

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [8]:
import pandas as pd
# Creacion de un DataFrame
df = pd.DataFrame(arreglo)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
##Modificacion de las columnas del DataFrame
# 'INDEX' para las columnas en Vertical y 'COLUMNS' para las columnas en Horizontal
df = pd.DataFrame(data = arreglo, index = ['A', 'B', 'C'], columns = ['D', 'E', 'F'])
df

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [20]:
## Seccion superior (ENCABEZADO)
df.head(2)

   D  E  F
A  1  2  3
B  4  5  6

In [22]:
## Informacion de cada Columna
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   D       3 non-null      int32
 1   E       3 non-null      int32
 2   F       3 non-null      int32
dtypes: int32(3)
memory usage: 60.0+ bytes

In [24]:
##Dimencion del DataFrame
df.shape

(3, 3)

In [26]:
# Calculo de Estadisticas Generales en la Tabla
df.describe()

         D    E    F
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [28]:
#Nombre de las columnas
df.columns

Index(['D', 'E', 'F'], dtype='object')

In [30]:
# Nombre de los renglones
df.index

Index(['A', 'B', 'C'], dtype='object')

In [32]:
# Adicion de un nuevo reglon al DataFrame
df.loc['G'] = [11, 12, 13]
df

    D   E   F
A   1   2   3
B   4   5   6
C   7   8   9
G  11  12  13

In [34]:
## Adicion de una nueva columna
df['H'] = [17, 16, 15, 14]
df

    D   E   F   H
A   1   2   3  17
B   4   5   6  16
C   7   8   9  15
G  11  12  13  14

In [36]:
## Extraccion de columnas del DataFrame
df2 = df[['E', 'H']]
df2

    E   H
A   2  17
B   5  16
C   8  15
G  12  14

In [42]:
##Extraccion de renglones en un DataFrame
df3 = df.iloc[0:2] ##Extrae los primero 2 renglones
df3

   D  E  F   H
A  1  2  3  17
B  4  5  6  16

In [44]:
# Cambiar de nombre a todas las comnas
df.columns = ['Columna1', 'Columna2', 'Columna3', 'Columna4']
df

   Columna1  Columna2  Columna3  Columna4
A         1         2         3        17
B         4         5         6        16
C         7         8         9        15
G        11        12        13        14

In [46]:
# Cambio de nombre en ALGUNAS columnas
df.rename(columns = {'Columna1': 'Column1', 'Columna2': 'Columns2'}, inplace = True)
df

   Column1  Columns2  Columna3  Columna4
A        1         2         3        17
B        4         5         6        16
C        7         8         9        15
G       11        12        13        14

In [48]:
# Cambio de nombre en renglones
df.rename(index = {'A': 'Dato1', 'B': 'Dato2'}, inplace = True)
df

       Column1  Columns2  Columna3  Columna4
Dato1        1         2         3        17
Dato2        4         5         6        16
C            7         8         9        15
G           11        12        13        14

In [50]:
## Ordenamiento del DataFrame
df4 = df.sort_values('Columna4', ascending=True)
df4

       Column1  Columns2  Columna3  Columna4
G           11        12        13        14
C            7         8         9        15
Dato2        4         5         6        16
Dato1        1         2         3        17

In [54]:
## Verificacion de Condiciones en DataFrames
df['Columns2'] > 5

Dato1    False
Dato2    False
C         True
G         True
Name: Columns2, dtype: bool

In [60]:
df[df["Columns2"] > 5]

   Column1  Columns2  Columna3  Columna4
C        7         8         9        15
G       11        12        13        14

In [66]:
## Condiciones Multiples
##Condicion 1 Que cheque que elementos tiene en la columna 1 valores superiores a 1
##Condicion 2 que cheque en la columna 2 valores menores a 12

condicion1 = df['Column1'] > 1
condicion2 = df['Columns2'] < 12
df[condicion1 & condicion2]

       Column1  Columns2  Columna3  Columna4
Dato2        4         5         6        16
C            7         8         9        15

In [72]:
arreglo = np.array([['Bella', 'Labrador', 'Cafe', 56, 24, '2013-07-01'],
                    ['Charlie', 'Poodle', 'Negro', 43, 24, '2016-09-16'], 
                    ['Lucy', 'Chow Chow', 'Cafe', 46, 24, '2014-08-25'],
                    ['Cooper', 'Schnauzer', 'Gris', 49, 17, '2011-12-11'],
                    ['Bernie', 'San Bernardo', 'Blanco', 77, 74, '2018-02-27']])
arreglo

array([['Bella', 'Labrador', 'Cafe', '56', '24', '2013-07-01'],
       ['Charlie', 'Poodle', 'Negro', '43', '24', '2016-09-16'],
       ['Lucy', 'Chow Chow', 'Cafe', '46', '24', '2014-08-25'],
       ['Cooper', 'Schnauzer', 'Gris', '49', '17', '2011-12-11'],
       ['Bernie', 'San Bernardo', 'Blanco', '77', '74', '2018-02-27']],
      dtype='<U12')

In [74]:
df = pd.DataFrame(data=arreglo, columns=['Nombre', 'Raza', 'Color', 'Altura_cm', 'Peso_kg', 'Fecha_nac'])
df

    Nombre          Raza   Color Altura_cm Peso_kg   Fecha_nac
0    Bella      Labrador    Cafe        56      24  2013-07-01
1  Charlie        Poodle   Negro        43      24  2016-09-16
2     Lucy     Chow Chow    Cafe        46      24  2014-08-25
3   Cooper     Schnauzer    Gris        49      17  2011-12-11
4   Bernie  San Bernardo  Blanco        77      74  2018-02-27

In [76]:
# Inciso 1
# Extraccion de los Perros cuya fecha de nacimiento es anterior al 1 de enero del 2015
df2 = df[df['Fecha_nac'] < '2015-01-01']
df2

   Nombre       Raza Color Altura_cm Peso_kg   Fecha_nac
0   Bella   Labrador  Cafe        56      24  2013-07-01
2    Lucy  Chow Chow  Cafe        46      24  2014-08-25
3  Cooper  Schnauzer  Gris        49      17  2011-12-11

In [82]:
# Inciso 2
# Extraer el registro de los perro cuya estatura es mayor a 50 cm
# Primero hay que modificar el tipo de dato con el que se registro el peso y el tamaÃ±o 
#ya que se registro como 'CARACTER' 
# De esta forma cambianmos el Type
df['Altura_cm'] = df['Altura_cm'].astype(int)

In [80]:
df[df['Altura_cm']> 50]

   Nombre          Raza   Color  Altura_cm Peso_kg   Fecha_nac
0   Bella      Labrador    Cafe         56      24  2013-07-01
4  Bernie  San Bernardo  Blanco         77      74  2018-02-27

In [90]:
# Inciso 3
# Agregar una nueva columna a este DataFrame que calcule el indice de masa muscular (IMM) para cada perro
#El cual esta dado por esta formula: IMM = (Peso_kg) / (Altura en metros)2
# Igual hay que convertir el Type del dato, de Caracter a entero
df['Peso_kg'] = df['Peso_kg'].astype(int)

df['IMM'] = df['Peso_kg'] / (df['Altura_cm'] / 100) ** 2
df

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_nac         IMM
0    Bella      Labrador    Cafe         56       24  2013-07-01   76.530612
1  Charlie        Poodle   Negro         43       24  2016-09-16  129.799892
2     Lucy     Chow Chow    Cafe         46       24  2014-08-25  113.421550
3   Cooper     Schnauzer    Gris         49       17  2011-12-11   70.803832
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27  124.810255

In [96]:
## Otras manipulaciones
# Extraccion de las columnas Nombre, Raza y IMM
df2 = df[['Nombre', 'Raza', 'IMM']]
df2

    Nombre          Raza         IMM
0    Bella      Labrador   76.530612
1  Charlie        Poodle  129.799892
2     Lucy     Chow Chow  113.421550
3   Cooper     Schnauzer   70.803832
4   Bernie  San Bernardo  124.810255

In [100]:
# De esta Forma ordenamos nuestos Datos requeridos de forma ascendente en volumen de masa
df2 = df2.sort_values('IMM', ascending = True)
df2

    Nombre          Raza         IMM
3   Cooper     Schnauzer   70.803832
0    Bella      Labrador   76.530612
2     Lucy     Chow Chow  113.421550
4   Bernie  San Bernardo  124.810255
1  Charlie        Poodle  129.799892